README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="README"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-13 17:30:20 CEST"/>
<meta name="author" content="karel"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">README</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Description</a></li>
<li><a href="#sec-2">2 Dependencies</a></li>
<li><a href="#sec-3">3 Example</a>
<ul>
<li><a href="#sec-3-1">3.1 Setup html page</a></li>
<li><a href="#sec-3-2">3.2 Create an enyo app</a></li>
<li><a href="#sec-3-3">3.3 Add some style</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Description</h2>
<div class="outline-text-2" id="text-1">

<p>This component is a multi-purpose extension of the <a href="http://enyojs.com">enyojs</a> list component. It allows the user to select items in the list by holding, pull them out and insert them at another location. All using drag and drop.
</p>
<p>
The user can scroll through the list while dragging in order to move some element to a far away position.
</p>
<p>
When the user drags an item out of the list and drops it outside the list, the item gets removed unless the list's allowRemove property is set to false.
</p>
<p>
The user is also able to use the <i>reorderList</i> function, providing the list with a remove index, an insert object or both.
</p>
<p>
The reorderList requires knowledge about the data it contains. To this purpose it has its own data property. The count of the list is inferred from the data property and should not be set directly.
</p>
<p>
For more information, look at the comments in the code/api. All code is contained in the ReorderableList.js file.
</p>
<p>
This component has been tested on the following browsers:
</p><ul>
<li>Chromium 18.0.1025.168, linux
</li>
<li>Firefox 15.0.1 for ubuntu
</li>
<li>Opera 12.02, linux
</li>
<li>Firefox for mobile, 15.0, android
</li>
<li>Safari IOS 5.1.1, ipod
</li>
<li>windows browsers coming up as soon as I get home
</li>
</ul>


<p>
License: <a href="http://en.wikipedia.org/wiki/MIT_License">MIT</a>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Dependencies</h2>
<div class="outline-text-2" id="text-2">

<p>The reorderable list depends on the enyo <b>layout package</b>. Therefore, the following package file is required:
</p>



<pre class="example">enyo.depends(
    "$lib/layout",
    "ReorderableList.js",
    "reorderlist.css"
);
</pre>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Example</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Setup html page</h3>
<div class="outline-text-3" id="text-3-1">

<p>This is an example of how to use the ReorderableList. First we build a general html page for hosting our app:
</p>



<pre class="example">&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;Testing Reorderable List&lt;/title&gt;
    &lt;link rel="shortcut icon" href="../assets/favicon.ico"&gt;
    &lt;!-- --&gt;
    &lt;meta http-equiv="Content-Type" content="text/html; charset=utf8"&gt;
    &lt;meta name="apple-mobile-web-app-capable" content="yes"&gt;
    &lt;meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no"&gt;
    &lt;!-- enyo (debug) --&gt;
    &lt;link rel=stylesheet href="http://enyojs.com/enyo-2.0.1/enyo.css"&gt;
    &lt;link rel=stylesheet href="example.css" type="text/css" media="screen" /&gt;
    &lt;script src="http://enyojs.com/enyo-2.0.1/enyo.js"&gt;&lt;/script&gt;
    &lt;!-- application (debug) --&gt;
    &lt;script src="package.js" type="text/javascript"&gt;&lt;/script&gt;
  &lt;/head&gt;
  &lt;body class="enyo-unselectable"&gt;
    &lt;script type="text/javascript" src="testlist.js"&gt;&lt;/script&gt;
  &lt;/body&gt;
&lt;/html&gt;
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Create an enyo app</h3>
<div class="outline-text-3" id="text-3-2">

<p>Then we need to setup our app in the testlist.js file. The contents of this file may need some explanation, I will zoom in on them below.
</p>
<p>
As you can see, we will handle the onSetupItem event for our Reorderable list, just like we would with a normal list.
</p>



<pre class="example">var app=new enyo.kind({
    name:"App",
    handlers:{
        onSetupItem:"setupItem"
    },
    components:[
        {name: "list", kind: "ReorderableList",
         style:"height:100%; width:50px;",
         pullingMessage: "",
         pulledMessage: "",
         loadingMessage: "",
         pullingIconClass: "",
         pulledIconClass: "",
         loadingIconClass: "",
         fit: true,
         components: [
             {style: "padding: 10px;",name:"listContent",
              content:"foo"
             }
         ]}
    ]  ,
    create:function(){
        this.inherited(arguments);
        var data=[];
        for(var i=0;i&lt;100; i++){
            data.push(i);
        }
        this.$.list.setData(data);
    },
    setupItem:function(source,event){
        this.$.listContent.setContent(this.$.list.data[event.index]);
    }
});     
new App().renderInto(document.body);

</pre>


<p>
The single component of our app is a reorderable list. It behaves exactly like a normal list. However, I disabled all messages for this list as they only generated clutter to my eyes. To do so is optional however.
</p>
<p>
Also note the flyweight component in the list. I gave it some default content ("foo") to show that this content does not matter and will be overwritten when we create our items.
</p>



<pre class="example">components:[
    {name: "list", kind: "ReorderableList",
     style:"height:100%; width:50px;",
     pullingMessage: "",
     pulledMessage: "",
     loadingMessage: "",
     pullingIconClass: "",
     pulledIconClass: "",
     loadingIconClass: "",
     fit: true,
     components: [
         {style: "padding: 10px;",name:"listContent",
          content:"foo"
         }
     ]}
]  
</pre>


<p>
When our app gets created, we provide our list with data. This is a new property, normal lists had no knowledge of their data but simply fire onSetupItem events. This is impossible for reorderable lists, which also need to track index changes. The data can contain anything, but it should be an array and it should be used when handling the onSetupItem event (below).
</p>



<pre class="example">create:function(){
    this.inherited(arguments);
    var data=[];
    for(var i=0;i&lt;100; i++){
        data.push(i);
    }
    this.$.list.setData(data);
}
</pre>


<p>
Handling the onSetupItem event is pretty straight-forward. We simply set the content of the current node in the list to the value contained at the node's index in the data list.
</p>



<pre class="example">setupItem:function(source,event){
    this.$.listContent.setContent(this.$.list.data[event.index]);
}
</pre>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Add some style</h3>
<div class="outline-text-3" id="text-3-3">

<p>To make the list look a little nicer, we want to style the placeholder component in the list by giving it a dark background using the reorderlist-holding class.
</p>
<p>
The dragger should also be transparant. For this you can use the reorderlist-dragger class.
</p>
<p>
Another point about styling that is worth mentioning is that while the component that is being dragged around is moved directly to the dragger's html node, this does not guarantee that the node will have the exact same look as the original component. This is because the original component's style may be influenced by the classes of its ancestor nodes. Because of cross-browser compatibility issues, it was too hard to ensure the dragged node has the exact same computed style as the original one. If your application suffers from such differences, please fix them by setting the dragger classes accordingly.
</p>



<pre class="example">.reorderlist-holding {
    background-color:rgb(50,50,50);
    color:white;
}
.reorderlist-dragger {
    opacity:0.7;
}
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-09-13 17:30:20 CEST</p>
<p class="author">Author: karel</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
